Table of Contents
 Class BulkSelection
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public class BulkSelection : Selection
Inheritance
object
Selection
BulkSelection
Inherited Members
 Selection.Nodes
 Selection.Members
 Selection.Members2D
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 BulkSelection(ISet<IIdeaNode>, ISet<IIdeaMember1D>, ISet<IIdeaConnectionPoint>, ISet<IIdeaMember2D>)
public BulkSelection(ISet<IIdeaNode> nodes, ISet<IIdeaMember1D> members, ISet<IIdeaConnectionPoint> connectionPoints = null, ISet<IIdeaMember2D> members2D = null)
Parameters
nodes ISet<IIdeaNode>
members ISet<IIdeaMember1D>
connectionPoints ISet<IIdeaConnectionPoint>
members2D ISet<IIdeaMember2D>
Properties
 ConnectionPoints
public ISet<IIdeaConnectionPoint> ConnectionPoints { get; }
Property Value
ISet<IIdeaConnectionPoint>
 Edit this page